app/controllers/form_for_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "cha"], ["email", "cha"], ["bio", "cha"], ["created_at", "2018-10-30 16:14:45.501033"], ["updated_at", "2018-10-30 16:14:45.501033"]]