app/controllers/form_tag_controller.rb

  def create
  	# puts params["first_name"]
  	user = User.new
  	user.username = (params["first_name"])
  	user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "ALEX"], ["created_at", "2018-10-30 15:11:54.007204"], ["updated_at", "2018-10-30 15:11:54.007204"]]