app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "a"], ["created_at", "2018-10-30 16:20:28.633380"], ["updated_at", "2018-10-30 16:20:28.633380"]]
---
  def create
  	# puts params["first_name"]
  	user = User.new
  	user.username = (params["first_name"])
  	user.save